Конфигурация/Catalogs/ПериодичностиОпределенияРыночнойСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПериодичностиОпределенияРыночнойСтавки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПервоначальноеПризнание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОфициальнаяОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеДатыДенежногоПотока</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеПравилСЧА</Name>
					<Comment>Изменение правил СЧА (хардкод*)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеСрокаИнструмента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеКлючевойСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ПериодичностиОпределенияРыночнойСтавки/Ext/ManagerModule.bsl
Функция ПроверкаТолькоПриПервоначальномПризнании(Ссылка) Экспорт
	
	ПроверкиТолькоПриПервоначальномПризнании = ПроверкиТолькоПриПервоначальномПризнании();
	
	Возврат (ПроверкиТолькоПриПервоначальномПризнании.Найти(Ссылка) <> Неопределено);

КонецФункции

Функция ПроверкиТолькоПриПервоначальномПризнании() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПериодичностиОпределенияРыночнойСтавки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|ГДЕ
		|	ПериодичностиОпределенияРыночнойСтавки.ПервоначальноеПризнание
		|	И НЕ ПериодичностиОпределенияРыночнойСтавки.ОфициальнаяОценка
		|	И НЕ ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока
		|	И НЕ ПериодичностиОпределенияРыночнойСтавки.ИзменениеПравилСЧА
		|	И НЕ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента
		|	И НЕ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСтавки
		|	И НЕ ПериодичностиОпределенияРыночнойСтавки.ИзменениеКлючевойСтавки");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);

КонецФункции
